'''
5. Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями;
-  Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї), пiд 
час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" і при нерiвностi 
змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
-  Повиннi опрацювати такi умови:
-  x > y;       вiдповiдь - х бiльше нiж у на z
-  x < y;       вiдповiдь - у бiльше нiж х на z
-  x == y.      вiдповiдь - х дорiвнює z
'''

x = int(input('Введіть х: '))
y = int(input('Введіть у: '))

def comparison_two_numbers (x, y):
    if x == y:
        return print(f'{x} дорівнює {y}')
    elif x > y:
        return print(f'{x} бiльше нiж {y} на {x - y}')
    else:
        return print(f'{y} бiльше нiж {x} на {y - x}')

comparison_two_numbers(x, y)